{

	"pieces": {
		"Algorithms & interactions":
			[
				{
					"name":"Courier",
					"tagline": "bikes in the machine",
					"url": "courier",
					"blurb": [
						"As Mapbox built a suite of tools around location and logistics -- navigation, geocoding, spatial analysis -- we wanted to build a compelling use case illustrating how these pieces could fit together. ",
						"We simulated a fictional courier service in Manhattan, where cyclists collected parcels throughout the city, carrying up to five before unloading at one of three dropoff points. As new parcels continuously appear, each courier would target  as their prioritization scheme the oldest and closest parcel for their next pickup.",
						"Though entirely a simulation, this demo has all the makings of a real logistics service inside the browser: collecting an influx of pickup addresses, reverse geocoding to convert them to coordinates, Turf.js to measure distances and assign each courier their next pickup, and cycling directions to navigate the courier there."
					]	
				},
				{
					"name":"Traveling Salesman solver",
					"tagline": "order of orders",
					"url": "optimizer",
					"blurb":[
						"Underpinning every logistics algorithm is an imperfect solution to the <a target='_blank' href='https://en.wikipedia.org/wiki/Travelling_salesman_problem'>Traveling Salesman problem</a>: what's the order to visit many points on a map, in a way minimizes the total travel time?",
						"Mapbox's Optimization API solves this, <i>plus</i> the option to specify that certain points must come before others. This became an incredibly nuanced, technical tool in search of a good explanation.",
						"For us, that surfaced in food delivery service. The user clicks and drags orders from three restaurants around Chicago, which a delivery driver fulfills. Each order must involve a pickup trip to the restaurant before heading to the customer, forming a complex queue that the algorithm handles in real time."
					]
				},
				{
					"name":"Cosmic Reef",
					"tagline": "generative geometry",
					"url": "https://www.youtube.com/embed/D2cU6QKCSnQ",
					"blurb": [
						"This was a generative art project taking simple geometric primitives to generate a large set of unique pieces. We did this by applying a series of animations, deformations, and color processes, to a recursively nested structure of shapes and systems. Introducing slight variations in each parameter produces a diverse set of pieces.",
						"Doing this performantly involves in GLSL shaders, which requires devising a higher-order framework of parameters that can encompass the full range of permutations and combinatorials.",
						"I built the rendering pipeline, as well as the GUI pictured here as a tool to explore and produce interesting compositions. The artist then took those combinations to seed the full set.",
						"Play with an early version of the tool <a target='_blank' href='./pieces/cr'>here</a>."
					]	
				}
			],

		"Data made visual":
			[
				{
					"name":"Muni, this moment",
					"tagline": "all aboard the transit panopticon",
					"url": "allthebuses",
					"blurb": [
						"Visualizing complex systems usually takes two angles: a broad system schematic explaining how components 'generally behave,' but devoid of concrete or real-time examples. Or a display of those specific, tangible elements, but without inferring broader trends and patterns of how they work together.",
						"This was an attempt to do both, with city transit. Beginning with that low-level view of individual vehicles, the user interacts with them to see the paths, stops, and predictions of each route. Progressive disclosure keeps the information manageable at each juncture. Another goal was iconography and visual grammar that's immediately legible, without explanation.",
						"First built in 2014, this was my first project after learning how to make network requests. Originally rendered as one massive SVG, with hundreds of discrete DOM elements animated with CSS transforms, I've updated it to use WebGL in Three.js and Mapbox."
					]
				},
				{
					"name": "Climate change economics",
					"tagline": "Costs of saving the planet",
					"url": "carbon",
					"blurb": [
						"Working with the Breakthrough Institute, I built this map to visualize the economic effects of carbon mitigation on counties across the US.",
						"Analyzing three strategies of increasing aggressiveness (SDS, SSP4, STPS), we studied both percentage and volume of stranded production, as well as projected effects on local employment."
					]
				},
				{
					"name":"Landgrab",
					"tagline": "Earth bumps, on demand",
					"url": "landgrab/#-112.418898,-112.521208,36.420777,36.341725",
					"blurb": [
						"Mapbox's focus in augmented reality fueled interest in immersive 3D experiences. We wanted to leverage our existing data and mapping stack for this emergent use case.",
						"Several pieces fell into place to make this possible: our satellite team found a <a target='_blank' href='https://blog.mapbox.com/global-elevation-data-6689f1d0ba65'>nimble way</a> to deliver global elevation data via png's, and we began experimenting with Three.js for complex shape rendering. These enabled us to build a fully interactive <a target='_blank' href=''>3D map of the world</a>, a lá Google Earth.",
						"To support developers building 3D worlds, we built a quick tool to inspect, select, and download the imagery and terrain information for a desired land tract."
					]
				},
			
				{
					"name": "Census population inspector",
					"tagline": "all you need is TIGER (data)",
					"url": "population",
					"blurb": [
						"Mapbox GL added an extrusion feature to render buildings in 3D. Because 3D often gets in the way more than it helps, we wanted to use it in a way that was actually more illuminating.",
						"A U.S. Census dataset gave us the opening to use this feature in a way that was truly helpful. Typically, population data is typically presented in two ways: a raw count in each region, and in density of people per unit of area.",
						"But by using each city block as a cross section, and extruding it up to a height correlated to its density, the shape's volume naturally represents the raw count. This enabled us to communicate both statistics simultaneously, in the same visual encoding."
					]
				},
				{
					"name":"USGS Earthquake watch",
					"tagline": "shaking around the Ring of Fire",
					"url": "earthquake",
					"blurb":[
						"We built this live earthquake tracker as a demonstration of Mapbox GL's new circle functionality.",
						"Using <a target='_blank' href='https://earthquake.usgs.gov/earthquakes/feed/v1.0/geojson.php'>USGS's live data feed</a>, we represented each event as a point, with a second blurred halo behind it to represent severity. This let us communicate frequency and severity simultaneously, without toggling between modes. The map also transitions smoothly to satellite imagery at higher zoom levels, to better portray any structures and inhabitants in the affected area.",
						"This was also one of the few maps where we shifted the longitudinal center away from the prime meridian, to better frame the clusters of quakes around the Pacific's Ring of Fire."
					],
					"press": "A real-time map of earthquakes around the world (The Atlantic)",
					"pressUrl": "https://www.citylab.com/environment/2016/06/a-real-time-map-of-earthquakes-around-the-world/487868/"
				}

			],

		"space and time":[
				{
					"name":"Isochrone generator",
					"tagline": "expectedly loud but surprisingly close",
					"url": "isochrone/#10/38.9006/-77.1502",
					"blurb": [
						"Isochrones always held a certain appeal to me: a plot of land around you circumscribed not by any physical property, but how <i>long</i> it takes to get there. The area can grow or shrink as you get near a highway, have more time to spare, or jump on a bike or car.",
						"For years, isochrones were prohibitively difficult to make with the tools we had. I began a long side quest in wrangling various APIs to sample across space and approximate the contours. But these were costly, time consuming, or otherwise unscalable for real-world use.",
						"It was the Matrix API that became my missing piece: an endpoint that could take hundreds of discrete points and return travel times between all of them. Viable algorithm in hand, I produced an <a target='_blank' href='https://github.com/mapbox/mapbox-isochrone'>open-source library</a> for isochrone generation, as well as this demo to visualize it."
					]	
				},
				{
					"name":"A map of time",
					"tagline": "a minute, as the clock flies",
					"url": "timemap/search",
					"blurb":[
						"This project was the culmination of several years of thinking around isochrones, ETAs, space, and time. I've noticed that when we talk about physical distance, we're often using it as a leaky substitute for how long it takes to traverse it. What would a map look like, if it directly visualized distance in time?",
						"A longer writeup of thinking and process was captured on the <a target='_blank' href='https://blog.mapbox.com/a-new-kind-of-map-its-about-time-7bd9f7916f7f'>Mapbox blog</a>."
					],
					"press": "There's An Entirely New Way Of Mapping The World, And It's Brilliant (Fast Company)",
					"pressUrl":"https://www.fastcompany.com/90143906/theres-an-entirely-new-way-of-mapping-the-world-and-its-brilliant"
				}	
		]
	}
}
